import { Markup } from 'telegraf'

export default function (bot, mainMenu, userState) {

    bot.hears("⚖ Юридична підтримка", (ctx) => {
        ctx.reply(
            "Ми надаємо юридичні консультації. Щоб отримати допомогу, будь ласка, надайте додаткову інформацію про себе у той спосіб, який є для вас найзручнішим.\n\n" +
            "Оберіть дію:",
            Markup.keyboard([
                ["📝 Потребую юр. допомоги"],
                ["↩️ Повернутися назад"]
            ]).resize()
        )
    })

    // -------------------------------
    // 1️⃣ Головне меню юридичної допомоги
    // -------------------------------
    bot.hears("📝 Потребую юр. допомоги", ctx => {
        userState[ctx.from.id] = {
            type: "legal",
            mode: "none",
            text: "",
            files: []
        }

        ctx.reply(
            "Оберіть, будь ласка, найзручніший спосіб подати запит:\n\n" +
            "1️⃣ *Описати коротко проблему* — створення заявки безпосередньо у Telegram. Ви зможете описати свою ситуацію, додати необхідні документи(за потреби) та завершити оформлення заявки.\n\n" +
            "2️⃣ *Заповнити анкету для юриста* — процес аналогічний першому варіанту, але відбувається через наш портал. Оберіть цей спосіб, якщо вам так зручніше.\n\n" +
            "3️⃣ *Надіслати контакт* — ви просто надсилаєте свій номер без додаткових пояснень, і наш юрист сам звʼяжеться з вами.\n\n" +
            "👇 Оберіть потрібний варіант:",
            Markup.keyboard([
                ["📝 Описати коротко проблему"],
                ["📄 Заповнити анкету для юриста"],
                [{ request_contact: true, text: "📱 Надіслати контакт" }],
                ["↩️ Назад"]
            ]).resize()
        )
    })

    // -------------------------------
    // 2️⃣ Заповнення анкети Airtable
    // -------------------------------
    bot.hears("📄 Заповнити анкету для юриста", ctx => {
        ctx.reply(
            "📄 *Анкета для юридичної підтримки*\n\n" +
            "Якщо вам зручніше — можете заповнити заявку у формі. Юрист отримає її одразу та звʼяжеться з вами.\n\n" +
            "🔗 Заповнити анкету:\n" +
            "https://airtable.com/app2Yg2dKMat5z8CI/pagq1JHS0Q2VQUuGC/form",
            { parse_mode: "Markdown" }
        )
    })

    // -------------------------------
    // 3️⃣ Опис короткої проблеми
    // -------------------------------
    bot.hears("📝 Описати коротко проблему", ctx => {
        userState[ctx.from.id].mode = "description"

        ctx.reply(
            "Опишіть, будь ласка, коротко вашу проблему.\n\n" +
            "📩 *Коли закінчите — натисніть Enter та надішліть повідомлення.*\n" +
            "Після цього ви зможете додати документи (за потреби) і завершити створення заявки.",
            Markup.keyboard([
                [{ request_contact: true, text: "📱 Надіслати контакт" }],
                ["↩️ Назад"]
            ]).resize()
        )
    })

}