import { Markup } from 'telegraf'

export default function (bot, mainMenu, userState) {

    bot.hears("✅ Психологічна підтримка", (ctx) => {
        ctx.reply(
            "Наші дипломовані психологи надають консультації родинам військовополонених, зниклих безвісти, а також тим, хто повернувся з полону. " +
            "Ми допомагаємо впоратися з емоційними викликами та відновити внутрішню рівновагу.\n\n" +
            "Оберіть дію:",
            Markup.keyboard([
                ["📝 Потребую допомоги", "↩️ Повернутися назад"]
            ]).resize()
        );
    });

    bot.hears("📝 Потребую допомоги", ctx => {

        userState[ctx.from.id] = {
            type: "psych",
            mode: "none",
            text: "",
            files: []
        }

        ctx.reply(
            "Надішліть контакт щоб ми могли з вами зв'язатись.",
            Markup.keyboard([
                [{ request_contact: true, text: "📱 Надіслати контакт" }],
                ["↩️ Назад"]
            ])
        )
    })

    bot.hears("↩️ Повернутися назад", ctx => {
        ctx.reply("Повертаю до головного меню", mainMenu)
    })

    bot.hears("↩️ Назад", ctx => {
        ctx.reply("Повертаю до головного меню", mainMenu)
    })
}