import { Markup } from "telegraf";

export default function (bot, mainMenu, userState) {

    bot.hears("🎧 Подкаст «Історії Сильних»", (ctx) => {
        ctx.reply(
            "Ми зберігаємо історії родин про своїх героїв у форматі подкасту «Історії Сильних», " +
            "щоб їхні голоси звучали й далі, а світ бачив за формою живих людей, " +
            "їхню любов і щоденну силу.\n\n" +
            "Щоб поділитися історією, оберіть дію нижче 👇",
            Markup.keyboard([
                ["🌟 Хочу поділитися історією"],
                ["↩️ Повернутися назад"]
            ]).resize()
        );
    });

    bot.hears("🌟 Хочу поділитися історією", ctx => {
        ctx.reply(
            "Будь ласка, надішліть ваш контакт, щоб наша команда могла зв’язатися з вами.",
            Markup.keyboard([
                [{ request_contact: true, text: "📱 Надіслати контакт" }],
                ["↩️ Назад"]
            ])
        );

        // зберігаємо режим
        userState[ctx.from.id] = { type: "story" };
    });

}