import { Markup } from "telegraf";

export default function (bot, mainMenu, userState) {

    bot.hears("🎧 Подкаст 'Історії Сильних'", ctx => {
        ctx.reply(
            "Подкасть «Історії Сильних» — поділіться історією свого героя. Нехай світ дізнається, що за формою стоїть жива людина, сильна духом.\n\n" +
            "Оберіть дію:",
            Markup.keyboard([
                ["🌟 Хочу поділитися історією"],
                ["↩️ Повернутися назад"]
            ]).resize()
        );
    });

    bot.hears("🌟 Хочу поділитися історією", ctx => {
        ctx.reply(
            "Будь ласка, надішліть ваш контакт, щоб наша команда могла зв’язатися з вами.",
            Markup.keyboard([
                [{ request_contact: true, text: "📱 Надіслати контакт" }],
                ["↩️ Назад"]
            ])
        );

        // зберігаємо режим
        userState[ctx.from.id] = { type: "story" };
    });

}